app/views/notes/index.html.erb

    		<div class="sent-by-who">
    			Sent by: <%= User.find_by_id(note.sent_by_id).email %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1