app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 1]]
---
  def index
    @notes = current_user.notes.order("created_at DESC")

INSERT INTO "notes" ("created_at", "data", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 13 Nov 2013 17:27:24 UTC +00:00], ["data", "Sex is good"], ["updated_at", Wed, 13 Nov 2013 17:27:24 UTC +00:00], ["user_id", 1]]
---
def aprocess
  current_user.notes.create(data: session[:pre_login])

INSERT INTO "notes" ("created_at", "data", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 12 Nov 2013 21:14:39 UTC +00:00], ["data", "Me cool"], ["updated_at", Tue, 12 Nov 2013 21:14:39 UTC +00:00], ["user_id", 1]]
---
  def create
    @note = Note.new(note_params)
    @note.user = current_user

    respond_to do |format|
      if @note.save

UPDATE "notes" SET "data" = $1, "updated_at" = $2 WHERE "notes"."id" = 5  [["data", "Hello this note very important for life have sex have dreams pls."], ["updated_at", Wed, 13 Nov 2013 07:42:27 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @note.update(note_params)

SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = $1 AND "notes"."id" = $2 LIMIT 1  [["user_id", 1], ["id", "2"]]
---
    def set_note

      @note = current_user.notes.find(params[:id])